Autodesk.Revit.DB.RevolvedFace
A revolved face of a 3d solid.
Remarks: Revolved faces are defined by revolved surfaces bounded by edge loops.
The surfaces provide natural UV parameterization to the faces.
S(u, v) = Origin + Curve0(v)*cos(u)*Radius[0] + Curve0(v)*sin(u)*Radius[1] + Curve1(v)*Axis,
where the profile curve has the parametric equation (Curve0(t), Curve1(t)).